#### MeshTriangle Members

---

|  |
| --- |
| MeshTriangle Class   Methods   Properties   See Also |

The  MeshTriangle  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Index | The index of the vertex in the Vertices array of the mesh, for indexed access. |
| Public property | Vertex | A vertex of the triangle. |

# See Also

MeshTriangle Class

Autodesk.Revit.DB Namespace